InformationRegisters/СоответствияОбъектовИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоответствияОбъектовИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УникальныйИдентификаторИсточникаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектВыгруженПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЕдиницыИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатураПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НоменклатураПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагАктуальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Фактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Фактура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлянцеваяПоверхность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолотна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦветФактуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЦветФактуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Фактура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Фактура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаУстановкиПотолка</Name>
					<Comment>#13122</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменДаннымиСобытияПотолки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбщиеДляВсехПлановОбменаПроцедурыИФункции

#КонецОбласти

#Область ОбменБазаПроизводстваБазаРозницы

// Процедура-обработчик события "ПередЗаписью" ссылочных типов данных (кроме документов) для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события, кроме типа ДокументОбъект
//  Отказ          - Булево - флаг отказа от выполнения обработчика
// 
Процедура ОбменДаннымиОбменБазаПроизводстваБазаРозницыПередЗаписью(Источник, Отказ) Экспорт
	
КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" документов для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - ДокументОбъект - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
// 
Процедура ОбменДаннымиОбменБазаПроизводстваБазаРозницыПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И Источник.АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуУП Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОрганизацияПроизводства", Источник.Организация);
		Запрос.УстановитьПараметр("КонтрагентРозницы", 		 Источник.Контрагент);
		Запрос.УстановитьПараметр("Дата", 		 			 Источник.Дата);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШапкаПланаОбмена.Ссылка КАК Узел
		|ИЗ
		|	ПланОбмена.ОбменБазаПроизводстваБазаРозницы КАК ШапкаПланаОбмена
		|ГДЕ
		|	НЕ ШапкаПланаОбмена.ЭтотУзел
		|	И ШапкаПланаОбмена.ЭтоБазаПроизводства
		|	И ШапкаПланаОбмена.ОрганизацияПроизводства = &ОрганизацияПроизводства
		|	И ШапкаПланаОбмена.КонтрагентРозницы = &КонтрагентРозницы
		|	И (&Дата >=  ШапкаПланаОбмена.ДатаНачалаВыгрузкиДокументов ИЛИ &Дата = ДАТАВРЕМЯ(1, 1, 1)) 
		|	И НЕ ШапкаПланаОбмена.ПометкаУдаления
		|";		
			
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Узел");
		Если МассивУзлов.Количество() > 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Источник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура-обработчик события "ПередУдалением" ссылочных типов данных для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
// 
Процедура ОбменДаннымиОбменБазаПроизводстваБазаРозницыПередУдалением(Источник, Отказ) Экспорт
		
КонецПроцедуры

#КонецОбласти

#Область РегистрацияИзмененийДляНачальнойВыгрузкиДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиСсылкуНаОбъектПоГуид(УзелИБ, СтроковыйГУИД) Экспорт
	
	Если ПустаяСтрока(СтроковыйГУИД) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.УникальныйИдентификаторИсточника КАК Ссылка
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.УникальныйИдентификаторПриемника = &УИД
	|	И ДанныеРегистра.УзелИнформационнойБазы = &УзелИБ
	|";
		
	Запрос.УстановитьПараметр("УИД", СтроковыйГУИД);
	Запрос.УстановитьПараметр("УзелИБ", УзелИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
	    Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

Процедура ЗаписатьСоответствиеОбъектов(УзелИБ, СсылкаНаОбъект, СтроковыйГУИД, ТипПриемника="") Экспорт
	
	Попытка
		МенеджерЗаписей = Новый Структура;
		МенеджерЗаписей.Вставить("УзелИнформационнойБазы", УзелИБ);
		МенеджерЗаписей.Вставить("УникальныйИдентификаторПриемника", СтроковыйГУИД);
		МенеджерЗаписей.Вставить("УникальныйИдентификаторИсточника", СсылкаНаОбъект);
		МенеджерЗаписей.Вставить("ТипПриемника", ТипПриемника);
		МенеджерЗаписей.Вставить("ТипИсточника", Строка(ТипЗнч(СсылкаНаОбъект)));
		РегистрыСведений.СоответствияОбъектовИнформационныхБаз.ДобавитьЗапись(МенеджерЗаписей, Истина);
	Исключение
		Сообщить("Не удалось записать в регистр соответсвия: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСтавкуНДСУИБ(ВнешнееСоединение, COMСтавкаНДС) Экспорт
	
	Если COMСтавкаНДС.Пустая() Тогда
		Возврат	Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
	
	НДСНомер = ВнешнееСоединение.Перечисления.СтавкиНДС.Индекс(COMСтавкаНДС);
	НДСИмя = ВнешнееСоединение.Метаданные().Перечисления.СтавкиНДС.EnumValues.Get(НДСНомер).Name;	
	Возврат Перечисления.СтавкиНДС[НДСИмя];
	
КонецФункции

Функция ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комНоменклатура, Знач ГруппаНовойНоменклатуры = Неопределено, ТекстОшибки) Экспорт
	
	Если комНоменклатура.Пустая() Тогда
		Возврат	Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаОбъект = Справочники.Номенклатура.НайтиПоНаименованию(комНоменклатура.Наименование, Истина);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат СсылкаНаОбъект;
	КонецЕсли;
	Если ГруппаНовойНоменклатуры = Неопределено Тогда
		ГруппаНовойНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();	
	КонецЕсли;
	
	НовыйОбъектСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор);
	НовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйОбъект.УстановитьСсылкуНового(НовыйОбъектСсылка);
	НовыйОбъект.Родитель = ГруппаНовойНоменклатуры;	
	НовыйОбъект.Наименование = комНоменклатура.Наименование;	
	НовыйОбъект.ПометкаУдаления = комНоменклатура.ПометкаУдаления;
 	
	ЗаполнитьЗначенияСвойств(НовыйОбъект, комНоменклатура, , 
				"Code, Owner, Parent,
				|АльтернативнаяЕдиницаИзмерения, БазоваяЕдиницаИзмерения, ВидНоменклатуры, ВидПроизводственнойУслуги,
				|Категория, ОсновнаяСпецификация, СтатьяДоходов, СтатьяРасходов, УДАЛИТЬ_Фактура, УДАЛИТЬ_ЦветФактуры,
				|ФайлКартинки, Шаблон, Потолок_Фактура, ДополнительныеРеквизиты");
	
	ВидНоменклатуры = ВнешнееСоединение.String(комНоменклатура.ВидНоменклатуры);
	НовыйОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(ВидНоменклатуры);
	
	Ед = ВнешнееСоединение.String(комНоменклатура.БазоваяЕдиницаИзмерения);
	НовыйОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Ед);
	
	Если НЕ комНоменклатура.АльтернативнаяЕдиницаИзмерения.Пустая() Тогда
		НоваяЕИОбъект = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
		НоваяЕИОбъект.УстановитьНовыйКод();
		НоваяЕИОбъект.Владелец = НовыйОбъектСсылка;
		НоваяЕИОбъект.Наименование = комНоменклатура.АльтернативнаяЕдиницаИзмерения.Наименование;
		НоваяЕИОбъект.Коэффициент = комНоменклатура.АльтернативнаяЕдиницаИзмерения.Коэффициент;
		НоваяЕИОбъект.Вес = комНоменклатура.АльтернативнаяЕдиницаИзмерения.Вес;
		Попытка
			НоваяЕИОбъект.ОбменДанными.Загрузка = Истина;
			НоваяЕИОбъект.Записать();
			НовыйОбъект.АльтернативнаяЕдиницаИзмерения = НоваяЕИОбъект.Ссылка;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	НовыйОбъект.Потолок_Фактура.Очистить();
	Для каждого комСтрокаТЧ из комНоменклатура.Потолок_Фактура Цикл
		НоваяСтрока = НовыйОбъект.Потолок_Фактура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, комСтрокаТЧ, 
			"ПродукцияКоличество, Основная, Фактура_МатериалЦвет, Фактура_МатериалМатериал, 
			|Фактура_МатериалКаталог, Фактура_КоличествоРасход, Фактура_КоличествоВыработка, Фактура_ШиринаПолотна");
		НоваяСтрока.ПродукцияФактура = ПолучитьФактуруУИБ(ВнешнееСоединение, комСтрокаТЧ.ПродукцияФактура);
	    НоваяСтрока.ПродукцияЦвет = ПолучитьЦветФактурыУИБ(ВнешнееСоединение, комСтрокаТЧ.ПродукцияЦвет, НоваяСтрока.ПродукцияФактура);
	КонецЦикла;
	
	Если НЕ комНоменклатура.ФайлКартинки.Пустая() И НовыйОбъект.ФайлКартинки.Пустая() Тогда		
		НовоеФотоОбъект = Справочники.НоменклатураПрисоединенныеФайлы.СоздатьЭлемент();
		НовоеФотоОбъект.ВладелецФайла = НовыйОбъектСсылка;
		НовоеФотоОбъект.Наименование = комНоменклатура.ФайлКартинки.Наименование;
		НовоеФотоОбъект.Расширение = комНоменклатура.ФайлКартинки.Расширение;
		НовоеФотоОбъект.ДатаСоздания = комНоменклатура.ФайлКартинки.ДатаСоздания;
		НовоеФотоОбъект.ФайлХранилище = Новый ХранилищеЗначения(Base64Значение(ВнешнееСоединение.Base64Строка(комНоменклатура.ФайлКартинки.ФайлХранилище.Получить())));

		Попытка
			НовоеФотоОбъект.ОбменДанными.Загрузка = Истина;
			НовоеФотоОбъект.Записать();
			НовыйОбъект.ФайлКартинки = НовоеФотоОбъект.Ссылка;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ПолучитьХарактеристикуУИБ(ВнешнееСоединение, комХарактеристика, НоменклатураСсылка) Экспорт
	
	Если комХарактеристика.Пустая() Тогда
		Возврат	Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		Возврат	Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;	
	
	СсылкаНаОбъект = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(комХарактеристика.Наименование, Истина, , НоменклатураСсылка);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) ТОгда
		Возврат СсылкаНаОбъект;
	КонецЕсли;
	
	НовыйОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	НовыйОбъект.Владелец = НоменклатураСсылка;	
	НовыйОбъект.Наименование = комХарактеристика.Наименование;	
	
	Попытка
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияУИБ(ВнешнееСоединение, комЕдиница, НоменклатураСсылка) Экспорт
	
	Если комЕдиница = Неопределено ИЛИ комЕдиница = NULL ИЛИ комЕдиница.Пустая() Тогда
		Возврат	Неопределено;
	КонецЕсли;
	
	Если комЕдиница.Метаданные().Имя = "ЕдиницыИзмерений" Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураСсылка, "АльтернативнаяЕдиницаИзмерения");
	Иначе //комЕдиница.Метаданные().Имя = "КлассификаторЕдиницИзмерения" Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураСсылка, "БазоваяЕдиницаИзмерения");
	КонецЕсли;

КонецФункции

Функция ПолучитьФактуруУИБ(ВнешнееСоединение, комФактура) Экспорт
	
	Если комФактура.Пустая() Тогда
		Возврат	Справочники.Фактура.ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаОбъект = Справочники.Фактура.НайтиПоНаименованию(комФактура.Наименование, Истина);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) ТОгда
		Возврат СсылкаНаОбъект;
	КонецЕсли;
	
	НовыйОбъект = Справочники.Фактура.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйОбъект, комФактура, 
		"Наименование, Гарантия, Каталог, Материал, 
		|МобильныйПостроитель_Группа, МобильныйПостроитель_Код, 
		|ПроцентРастяженияПоУ, ПроцентРастяженияПоХ, ШиринаПолотна");
		
	Попытка
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Справочники.Фактура.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция ПолучитьЦветФактурыУИБ(ВнешнееСоединение, комЦвет, ФактураСсылка) Экспорт
	
	Если комЦвет.Пустая() Тогда
		Возврат	Справочники.ЦветФактуры.ПустаяСсылка();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ФактураСсылка) Тогда
		Возврат	Справочники.ЦветФактуры.ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаОбъект = Справочники.ЦветФактуры.НайтиПоНаименованию(комЦвет.Наименование, Истина, , ФактураСсылка);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) ТОгда
		Возврат СсылкаНаОбъект;
	КонецЕсли;
	
	НовыйОбъект = Справочники.ЦветФактуры.СоздатьЭлемент();
	НовыйОбъект.Владелец = ФактураСсылка;
	ЗаполнитьЗначенияСвойств(НовыйОбъект, комЦвет, "Наименование, МобильныйПостроитель_Код, МобильныйПостроитель_Фактура");
	
	ТекстОшибки = "";
	Если НЕ комЦвет.Номенклатура.Пустая() Тогда
		НовыйОбъект.Номенклатура = ПолучитьНоменклатуруУИБ(ВнешнееСоединение, комЦвет.Номенклатура, , ТекстОшибки);
	КонецЕсли;	
	
	Попытка
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Справочники.ЦветФактуры.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

#КонецОбласти
